'''
    购买一级五行石
'''
zs = 0.05 # 钻石消耗0.05金
vit = 1 # 体力消耗1金
l1_value = 0.75 # 购买一级五行石花费0.75金
l1_value_zs = 8 # 一颗一级五行石还需消耗8颗钻石

'''
    一级五行石合成三级五行石
'''
l1_to_l3 = 12 # 一颗一级五行石升级为3级五行石，还需消耗12颗一级五行石
l1_to_l3_gold = 0.39 # 升级同时消耗0.39金
l1_to_l3_vit = 10 # 升级同时需消耗10点体力

'''
    三级五行石合成四级五行石
'''
l3_to_l4 = 16 #一颗三级五行石升级为四级五行石，还需消耗16颗一级五行石
l3_to_l4_gold = 0.897 # 升级同时消耗0.897金
l3_to_l4_vit = 10 # 升级同时消耗10点体力
l3_to_l4_rate = 0.4878 # 升级成功的概率为0.4878

'''
    四级五行石合成六级五行石
'''
l4_to_l6 = 12 #一颗四级五行石升级为六级五行石，需要消耗12颗四级五行石
l4_to_l6_gold = 19.75
l4_to_l6_vit = 10
